// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).

Console.Write("Введите число: ");
int x = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Квадрат введенного числа = " + x * x);